Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:atdf="http://crownking/atdf" xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:name="PIC32CX2051MTG64" edc:arch="arm32bit" edc:procid="0x0000" atdf:architecture="CORTEX-M4" atdf:family="PIC32CXMT" edc:hasFreeze="false" edc:masksetid="SG003">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:minvoltage="2.25" edc:maxvoltage="3.6" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true"/>
  <edc:ArchDef edc:name="arm32bit" edc:desc="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv7m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:irq="-15" edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset"/>
    <edc:Interrupt edc:irq="-14" edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted"/>
    <edc:Interrupt edc:irq="-13" edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault"/>
    <edc:Interrupt edc:irq="-12" edc:cname="MemoryManagement" edc:desc="Memory Management, MPU mismatch, including Access Violation and No Match"/>
    <edc:Interrupt edc:irq="-11" edc:cname="BusFault" edc:desc="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
    <edc:Interrupt edc:irq="-10" edc:cname="UsageFault" edc:desc="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
    <edc:Interrupt edc:irq="-5" edc:cname="SVCall" edc:desc="System Service Call via SVC instruction"/>
    <edc:Interrupt edc:irq="-4" edc:cname="DebugMonitor" edc:desc="Debug Monitor"/>
    <edc:Interrupt edc:irq="-2" edc:cname="PendSV" edc:desc="Pendable request for system service"/>
    <edc:Interrupt edc:irq="-1" edc:cname="SysTick" edc:desc="System Tick Timer"/>
    <edc:Interrupt edc:irq="0" edc:cname="SUPC" edc:desc="Supply Controller" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="1" edc:cname="RSTC" edc:desc="Reset Controller" ltx:memberofperipheral="RSTC"/>
    <edc:Interrupt edc:irq="2" edc:cname="RTC" edc:desc="Real Time Clock" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:irq="3" edc:cname="RTT" edc:desc="Real Time Timer" ltx:memberofperipheral="RTT"/>
    <edc:Interrupt edc:irq="4" edc:cname="DWDT0" edc:desc="Dual Watchdog 0 Timer" ltx:memberofperipheral="DWDT"/>
    <edc:Interrupt edc:irq="5" edc:cname="DWDT1" edc:desc="Dual Watchdog 1 Timer" ltx:memberofperipheral="DWDT"/>
    <edc:Interrupt edc:irq="6" edc:cname="PMC" edc:desc="Power Management Controller" ltx:memberofperipheral="PMC"/>
    <edc:Interrupt edc:irq="7" edc:cname="SEFC0" edc:desc="Embedded Flash Controller 0" ltx:memberofperipheral="SEFC0"/>
    <edc:Interrupt edc:irq="8" edc:cname="SEFC1" edc:desc="Embedded Flash Controller 1" ltx:memberofperipheral="SEFC1"/>
    <edc:Interrupt edc:irq="9" edc:cname="FLEXCOM0" edc:desc="FLEXCOM 0 (USART0/SPI0/TWI0)" ltx:memberofperipheral="FLEXCOM0"/>
    <edc:Interrupt edc:irq="10" edc:cname="FLEXCOM1" edc:desc="FLEXCOM 1 (USART1/SPI1/TWI1)" ltx:memberofperipheral="FLEXCOM1"/>
    <edc:Interrupt edc:irq="11" edc:cname="FLEXCOM2" edc:desc="FLEXCOM 2 (USART2/SPI2/TWI2)" ltx:memberofperipheral="FLEXCOM2"/>
    <edc:Interrupt edc:irq="12" edc:cname="FLEXCOM3" edc:desc="FLEXCOM 3 (USART3/SPI3/TWI3)" ltx:memberofperipheral="FLEXCOM3"/>
    <edc:Interrupt edc:irq="13" edc:cname="FLEXCOM4" edc:desc="FLEXCOM 4 (USART4/SPI4/TWI4)" ltx:memberofperipheral="FLEXCOM4"/>
    <edc:Interrupt edc:irq="14" edc:cname="FLEXCOM5" edc:desc="FLEXCOM 5 (USART5/SPI5/TWI5)" ltx:memberofperipheral="FLEXCOM5"/>
    <edc:Interrupt edc:irq="15" edc:cname="FLEXCOM6" edc:desc="FLEXCOM 6 (USART6/SPI6/TWI6)" ltx:memberofperipheral="FLEXCOM6"/>
    <edc:Interrupt edc:irq="16" edc:cname="FLEXCOM7" edc:desc="FLEXCOM 7 (USART7/SPI7/TWI7)" ltx:memberofperipheral="FLEXCOM7"/>
    <edc:Interrupt edc:irq="17" edc:cname="PIOA" edc:desc="Application Core Parallel I/O Controller A (PIOA)" ltx:memberofperipheral="PIOA"/>
    <edc:Interrupt edc:irq="18" edc:cname="PIOA_SEC" edc:desc="Application Core Parallel I/O Controller A (PIOA) Secure Event Interrupt" ltx:memberofperipheral="PIOA"/>
    <edc:Interrupt edc:irq="19" edc:cname="PIOB" edc:desc="Application Core Parallel I/O Controller B (PIOB)" ltx:memberofperipheral="PIOB"/>
    <edc:Interrupt edc:irq="20" edc:cname="PIOB_SEC" edc:desc="Application Core Parallel I/O Controller B (PIOB) Secure Event Interrupt" ltx:memberofperipheral="PIOB"/>
    <edc:Interrupt edc:irq="21" edc:cname="PIOC" edc:desc="Application Core Parallel I/O Controller C (PIOC)" ltx:memberofperipheral="PIOC"/>
    <edc:Interrupt edc:irq="22" edc:cname="PIOC_SEC" edc:desc="Application Core Parallel I/O Controller C (PIOC) Secure Event Interrupt" ltx:memberofperipheral="PIOC"/>
    <edc:Interrupt edc:irq="23" edc:cname="QSPI" edc:desc="Quad IO Serial Peripheral Interface" ltx:memberofperipheral="QSPI"/>
    <edc:Interrupt edc:irq="24" edc:cname="ADC" edc:desc="Analog To Digital Converter" ltx:memberofperipheral="ADC"/>
    <edc:Interrupt edc:irq="25" edc:cname="ACC" edc:desc="Analog Comparator" ltx:memberofperipheral="ACC"/>
    <edc:Interrupt edc:irq="30" edc:cname="MEM2MEM0" edc:desc="Application Core Memory to Memory Transfer Controller (MEM2MEM0)" ltx:memberofperipheral="MEM2MEM0"/>
    <edc:Interrupt edc:irq="31" edc:cname="TC0_CHANNEL0" edc:desc="Timer Counter 0, Channel 0" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="32" edc:cname="TC0_CHANNEL1" edc:desc="Timer Counter 0, Channel 1" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="33" edc:cname="TC0_CHANNEL2" edc:desc="Timer Counter 0, Channel 2" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="34" edc:cname="TC1_CHANNEL0" edc:desc="Timer Counter 1, Channel 0" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="35" edc:cname="TC1_CHANNEL1" edc:desc="Timer Counter 1, Channel 1" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="36" edc:cname="TC1_CHANNEL2" edc:desc="Timer Counter 1, Channel 2" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="37" edc:cname="TC2_CHANNEL0" edc:desc="Timer Counter 2, Channel 0" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="38" edc:cname="TC2_CHANNEL1" edc:desc="Timer Counter 2, Channel 1" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="39" edc:cname="TC2_CHANNEL2" edc:desc="Timer Counter 2, Channel 2" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="40" edc:cname="TC0_C0SEC" edc:desc="Timer Counter 0, Channel 0, Secure IRQ" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="41" edc:cname="TC0_C1SEC" edc:desc="Timer Counter 0, Channel 1, Secure IRQ" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="42" edc:cname="TC0_C2SEC" edc:desc="Timer Counter 0, Channel 2, Secure IRQ" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="43" edc:cname="TC1_C0SEC" edc:desc="Timer Counter 1, Channel 0, Secure IRQ" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="44" edc:cname="TC1_C1SEC" edc:desc="Timer Counter 1, Channel 1, Secure IRQ" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="45" edc:cname="TC1_C2SEC" edc:desc="Timer Counter 1, Channel 2, Secure IRQ" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="46" edc:cname="TC2_C0SEC" edc:desc="Timer Counter 2, Channel 0, Secure IRQ" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="47" edc:cname="TC2_C1SEC" edc:desc="Timer Counter 2, Channel 1, Secure IRQ" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="48" edc:cname="TC2_C2SEC" edc:desc="Timer Counter 2, Channel 2, Secure IRQ" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="49" edc:cname="AES" edc:desc="Advanced Enhanced Standard" ltx:memberofperipheral="AES"/>
    <edc:Interrupt edc:irq="50" edc:cname="AES_AESSEC" edc:desc="AES Secure Event Interrupt" ltx:memberofperipheral="AES"/>
    <edc:Interrupt edc:irq="51" edc:cname="AESB" edc:desc="AES Bridge" ltx:memberofperipheral="AESB"/>
    <edc:Interrupt edc:irq="52" edc:cname="AESB_AESBSEC" edc:desc="AES Bridge Secure Interrupt" ltx:memberofperipheral="AESB"/>
    <edc:Interrupt edc:irq="53" edc:cname="SHA" edc:desc="Secure Hash Algorithm" ltx:memberofperipheral="SHA"/>
    <edc:Interrupt edc:irq="54" edc:cname="SHA_SHASEC" edc:desc="SHA Secure Event Interrupt" ltx:memberofperipheral="SHA"/>
    <edc:Interrupt edc:irq="55" edc:cname="TRNG" edc:desc="True Random Generator" ltx:memberofperipheral="TRNG"/>
    <edc:Interrupt edc:irq="56" edc:cname="TRNG_TRNGSEC" edc:desc="TRNG Secure Event Interrupt" ltx:memberofperipheral="TRNG"/>
    <edc:Interrupt edc:irq="57" edc:cname="ICM" edc:desc="Integrity Check Module" ltx:memberofperipheral="ICM"/>
    <edc:Interrupt edc:irq="58" edc:cname="ICM_ICMSEC" edc:desc="Integrity Check Module" ltx:memberofperipheral="ICM"/>
    <edc:Interrupt edc:irq="59" edc:cname="CPKCC" edc:desc="Public Key Cryptography Controller" ltx:memberofperipheral="CPKCC"/>
    <edc:Interrupt edc:irq="60" edc:cname="MATRIX0" edc:desc="High-Speed Application Core Matrix (HSACM) (MATRIX0)" ltx:memberofperipheral="MATRIX0"/>
    <edc:Interrupt edc:irq="61" edc:cname="MATRIX1" edc:desc="Low-Speed Application Core Matrix (LSACM) (MATRIX1)" ltx:memberofperipheral="MATRIX1"/>
    <edc:Interrupt edc:irq="62" edc:cname="SUPC_WKUP3" edc:desc="External interrupt 3" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="63" edc:cname="SUPC_WKUP4" edc:desc="External interrupt 4" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="64" edc:cname="SUPC_WKUP5" edc:desc="External interrupt 5" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="65" edc:cname="SUPC_WKUP6" edc:desc="External interrupt 6" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="66" edc:cname="SUPC_WKUP7" edc:desc="External interrupt 7" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="67" edc:cname="SUPC_WKUP8" edc:desc="External interrupt 8" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="68" edc:cname="SUPC_WKUP9" edc:desc="External interrupt 9" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="69" edc:cname="SUPC_WKUP10" edc:desc="External interrupt 10" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="70" edc:cname="SUPC_WKUP11" edc:desc="External interrupt 11" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="71" edc:cname="SUPC_WKUP12" edc:desc="External interrupt 12" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="72" edc:cname="SUPC_WKUP13" edc:desc="External interrupt 13" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="73" edc:cname="SUPC_WKUP14" edc:desc="External interrupt 14" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="74" edc:cname="SUPC_WKUP15" edc:desc="External interrupt 15" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="78" edc:cname="MEM2MEM1" edc:desc="Metrology Core Memory to Memory Transfer Controller 1 (MEM2MEM1)" ltx:memberofperipheral="MEM2MEM1"/>
    <edc:Interrupt edc:irq="79" edc:cname="TC3_CHANNEL0" edc:desc="Timer Counter 3, Channel 0" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="80" edc:cname="TC3_CHANNEL1" edc:desc="Timer Counter 3, Channel 1" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="81" edc:cname="TC3_CHANNEL2" edc:desc="Timer Counter 3, Channel 2" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="82" edc:cname="TC3_C0SEC" edc:desc="Timer Counter 3, Channel 0, Secure IRQ" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="83" edc:cname="TC3_C1SEC" edc:desc="Timer Counter 3, Channel 1, Secure IRQ" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="84" edc:cname="TC3_C2SEC" edc:desc="Timer Counter 3, Channel 2, Secure IRQ" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="85" edc:cname="PIOD" edc:desc="Metrology Core Parallel I/O Controller D (PIOD)" ltx:memberofperipheral="PIOD"/>
    <edc:Interrupt edc:irq="86" edc:cname="PIOD_SEC" edc:desc="Metrology Core Parallel I/O Controller A Secure Interupt (named as PIOD)" ltx:memberofperipheral="PIOD"/>
    <edc:Interrupt edc:irq="90" edc:cname="PWM" edc:desc="Pulse Width Modulation" ltx:memberofperipheral="PWM"/>
    <edc:Interrupt edc:irq="94" edc:cname="MATRIX2" edc:desc="High-Speed Metrology Core Matrix (HSMCM) (Formely MATRIX2)" ltx:memberofperipheral="MATRIX2"/>
    <edc:Interrupt edc:irq="95" edc:cname="MATRIX3" edc:desc="Low-Speed Metrology Core Matrix (LSMCM) (Formely MATRIX3)" ltx:memberofperipheral="MATRIX3"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="ACC" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC" edc:desc=""/>
    <edc:Peripheral edc:cname="AES" edc:desc=""/>
    <edc:Peripheral edc:cname="AESB" edc:desc=""/>
    <edc:Peripheral edc:cname="CHIPID" edc:desc=""/>
    <edc:Peripheral edc:cname="CMCC0" edc:desc=""/>
    <edc:Peripheral edc:cname="CMCC1" edc:desc=""/>
    <edc:Peripheral edc:cname="CPKCC" edc:desc=""/>
    <edc:Peripheral edc:cname="DWDT" edc:desc=""/>
    <edc:Peripheral edc:cname="FLEXCOM0" edc:desc=""/>
    <edc:Peripheral edc:cname="FLEXCOM1" edc:desc=""/>
    <edc:Peripheral edc:cname="FLEXCOM2" edc:desc=""/>
    <edc:Peripheral edc:cname="FLEXCOM3" edc:desc=""/>
    <edc:Peripheral edc:cname="FLEXCOM4" edc:desc=""/>
    <edc:Peripheral edc:cname="FLEXCOM5" edc:desc=""/>
    <edc:Peripheral edc:cname="FLEXCOM6" edc:desc=""/>
    <edc:Peripheral edc:cname="FLEXCOM7" edc:desc=""/>
    <edc:Peripheral edc:cname="GPBR" edc:desc=""/>
    <edc:Peripheral edc:cname="ICM" edc:desc=""/>
    <edc:Peripheral edc:cname="MATRIX0" edc:desc=""/>
    <edc:Peripheral edc:cname="MATRIX1" edc:desc=""/>
    <edc:Peripheral edc:cname="MATRIX2" edc:desc=""/>
    <edc:Peripheral edc:cname="MATRIX3" edc:desc=""/>
    <edc:Peripheral edc:cname="MEM2MEM0" edc:desc=""/>
    <edc:Peripheral edc:cname="MEM2MEM1" edc:desc=""/>
    <edc:Peripheral edc:cname="PIO0" edc:desc=""/>
    <edc:Peripheral edc:cname="PIOA" edc:desc=""/>
    <edc:Peripheral edc:cname="PIOB" edc:desc=""/>
    <edc:Peripheral edc:cname="PIOC" edc:desc=""/>
    <edc:Peripheral edc:cname="PIO1" edc:desc=""/>
    <edc:Peripheral edc:cname="PIOD" edc:desc=""/>
    <edc:Peripheral edc:cname="PMC" edc:desc=""/>
    <edc:Peripheral edc:cname="PWM" edc:desc=""/>
    <edc:Peripheral edc:cname="QSPI" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTT" edc:desc=""/>
    <edc:Peripheral edc:cname="SEFC0" edc:desc=""/>
    <edc:Peripheral edc:cname="SEFC1" edc:desc=""/>
    <edc:Peripheral edc:cname="SFR" edc:desc=""/>
    <edc:Peripheral edc:cname="SFRBU" edc:desc=""/>
    <edc:Peripheral edc:cname="SHA" edc:desc=""/>
    <edc:Peripheral edc:cname="SUPC" edc:desc=""/>
    <edc:Peripheral edc:cname="SYSCWP" edc:desc=""/>
    <edc:Peripheral edc:cname="TC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TC3" edc:desc=""/>
    <edc:Peripheral edc:cname="TRNG" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="LOCKBIT" edc:desc=""/>
    <edc:Peripheral edc:cname="CoreDebug" edc:desc=""/>
    <edc:Peripheral edc:cname="DWT" edc:desc=""/>
    <edc:Peripheral edc:cname="FPU" edc:desc=""/>
    <edc:Peripheral edc:cname="ITM" edc:desc=""/>
    <edc:Peripheral edc:cname="MPU" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="SystemControl" edc:desc=""/>
    <edc:Peripheral edc:cname="TPI" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R0" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="0"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R1" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="4"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R2" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="8"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R3" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="12"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R4" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="16"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R5" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="20"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R6" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="24"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R7" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="28"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R8" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="32"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R9" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="36"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R10" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="40"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R11" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="44"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R12" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="48"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="SP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Stack Pointer" edc:nmmrid="52"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="MSP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Main Stack Pointer" edc:nmmrid="64"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Process Stack Pointer" edc:nmmrid="68"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="LR" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:desc="Link Register" edc:nmmrid="56"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PC" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Program Counter" edc:nmmrid="60"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSR" edc:impl="0xFF00FDFF" edc:access="nnnnnnnn--------nnnnnn-nnnnnnnnn" edc:por="00000001000000000000000000000000" edc:mclr="00000001000000000000000000000000" edc:desc="Program Status Register" edc:nmmrid="72"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="APSR" edc:impl="0xF80F0000" edc:access="nnnnn-------nnnn----------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Application Program Status Register" edc:nmmrid="76"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="IPSR" edc:impl="0x1FF" edc:access="-----------------------rrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Interrupt Program Status Register" edc:nmmrid="80"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="EPSR" edc:impl="0x700FC00" edc:access="-----rrr--------rrrrrr----------" edc:por="00000001000000000000000000000000" edc:mclr="00000001000000000000000000000000" edc:desc="Execution Program Status Register" edc:nmmrid="84"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PRIMASK" edc:impl="0x1" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Priority Mask Register" edc:nmmrid="88"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="FAULTMASK" edc:impl="0x1" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Fault Mask Register" edc:nmmrid="92"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="BASEPRI" edc:impl="0xFF" edc:access="------------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Base Priority Mask Register" edc:nmmrid="96"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="CONTROL" edc:impl="0x7" edc:access="-----------------------------nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Control Register" edc:nmmrid="100"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="FPSCR" edc:impl="0xFFF79F9F" edc:access="nnnnnnnnnnnn-nnnn--nnnnnn--nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Status And Control Register" edc:nmmrid="144"/>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D0" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S0" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="148"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S1" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="152"/>
      </edc:JoinedSFRDef>
