Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX_PR15MATRIX1_PRBS" edc:nzwidth="0x20" edc:access="-nnn-nnn-nnn-nnn-nnn-nnn-nnn-nnn" edc:impl="0x77777777" edc:_addr="0x400440FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN8" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 8"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x2" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN9" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 9"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN10" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 10"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x2" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN11" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 11"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN12" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 12"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x2" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN13" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 13"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x2" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN14" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 14"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x2" edc:desc="Master 15 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN15" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_MRCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40044100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="RCB0" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 0"/>
            <edc:SFRFieldDef edc:cname="RCB1" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 1"/>
            <edc:SFRFieldDef edc:cname="RCB2" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 2"/>
            <edc:SFRFieldDef edc:cname="RCB3" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 3"/>
            <edc:SFRFieldDef edc:cname="RCB4" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 4"/>
            <edc:SFRFieldDef edc:cname="RCB5" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 5"/>
            <edc:SFRFieldDef edc:cname="RCB6" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 6"/>
            <edc:SFRFieldDef edc:cname="RCB7" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 7"/>
            <edc:SFRFieldDef edc:cname="RCB8" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 8"/>
            <edc:SFRFieldDef edc:cname="RCB9" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 9"/>
            <edc:SFRFieldDef edc:cname="RCB10" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 10"/>
            <edc:SFRFieldDef edc:cname="RCB11" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 11"/>
            <edc:SFRFieldDef edc:cname="RCB12" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 12"/>
            <edc:SFRFieldDef edc:cname="RCB13" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 13"/>
            <edc:SFRFieldDef edc:cname="RCB14" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 14"/>
            <edc:SFRFieldDef edc:cname="RCB15" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40044104"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004411C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
