Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="PIO0" edc:cname="PIO_GROUP1PIO0_LOCKSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4004804C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO0">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Lock Status"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Lock Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIO0" edc:cname="PIO_GROUP1PIO0_SODR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40048050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO0">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Set Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
