Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
      <edc:AdjustPoint edc:offset="0x6C18" edc:_addr="0x400495E8"/>
      <edc:SFRDef ltx:memberofperipheral="CHIPID" edc:cname="CHIPID_CIDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40050200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CHIPID">
            <edc:SFRFieldDef edc:cname="VERSION" edc:nzwidth="0x5" edc:desc="Version of the Device"/>
            <edc:SFRFieldDef edc:cname="EPROC" edc:nzwidth="0x3" edc:desc="Embedded Processor">
              <edc:SFRFieldSemantic edc:cname="SAMx7" edc:desc="Cortex-M7" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ARM946ES" edc:desc="ARM946ES" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ARM7TDMI" edc:desc="ARM7TDMI" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CM3" edc:desc="Cortex-M3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ARM920T" edc:desc="ARM920T" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="ARM926EJS" edc:desc="ARM926EJS" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CA5" edc:desc="Cortex-A5" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CM4" edc:desc="Cortex-M4" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NVPSIZ" edc:nzwidth="0x4" edc:desc="Nonvolatile Program Memory Size">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_8K" edc:desc="8 Kbytes" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_16K" edc:desc="16 Kbytes" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_32K" edc:desc="32 Kbytes" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_64K" edc:desc="64 Kbytes" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_128K" edc:desc="128 Kbytes" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_160K" edc:desc="160 Kbytes" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="_256K" edc:desc="256 Kbytes" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="_512K" edc:desc="512 Kbytes" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="_1024K" edc:desc="1024 Kbytes" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="_2048K" edc:desc="2048 Kbytes" edc:when="(field &amp; 0xF) == 0xE"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NVPSIZ2" edc:nzwidth="0x4" edc:desc="Second Nonvolatile Program Memory Size">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_8K" edc:desc="8 Kbytes" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_16K" edc:desc="16 Kbytes" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_32K" edc:desc="32 Kbytes" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_64K" edc:desc="64 Kbytes" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_128K" edc:desc="128 Kbytes" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_256K" edc:desc="256 Kbytes" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="_512K" edc:desc="512 Kbytes" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="_1024K" edc:desc="1024 Kbytes" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="_2048K" edc:desc="2048 Kbytes" edc:when="(field &amp; 0xF) == 0xE"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRAMSIZ" edc:nzwidth="0x4" edc:desc="Internal SRAM Size">
              <edc:SFRFieldSemantic edc:cname="_48K" edc:desc="48 Kbytes" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_192K" edc:desc="192 Kbytes" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_384K" edc:desc="384 Kbytes" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_6K" edc:desc="6 Kbytes" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_24K" edc:desc="24 Kbytes" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_4K" edc:desc="4 Kbytes" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_80K" edc:desc="80 Kbytes" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_160K" edc:desc="160 Kbytes" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_8K" edc:desc="8 Kbytes" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="_16K" edc:desc="16 Kbytes" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="_32K" edc:desc="32 Kbytes" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="_64K" edc:desc="64 Kbytes" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="_128K" edc:desc="128 Kbytes" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="_256K" edc:desc="256 Kbytes" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="_96K" edc:desc="96 Kbytes" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="_512K" edc:desc="512 Kbytes" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ARCH" edc:nzwidth="0x8" edc:desc="Architecture Identifier">
              <edc:SFRFieldSemantic edc:cname="PIC32CXMTSH128" edc:desc="Dual Core, Single Phase, High Accuracy (128-lead version)" edc:when="(field &amp; 0xFF) == 0xC3"/>
              <edc:SFRFieldSemantic edc:cname="PIC32CXMTC128" edc:desc="Dual Core (128-lead version)" edc:when="(field &amp; 0xFF) == 0xC5"/>
              <edc:SFRFieldSemantic edc:cname="PIC32CXMTG64" edc:desc="Single Core (64-lead version)" edc:when="(field &amp; 0xFF) == 0xC6"/>
              <edc:SFRFieldSemantic edc:cname="PIC32CXMTG128" edc:desc="Single Core (128-lead version)" edc:when="(field &amp; 0xFF) == 0xC8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NVPTYP" edc:nzwidth="0x3" edc:desc="Nonvolatile Program Memory Type">
              <edc:SFRFieldSemantic edc:cname="ROM" edc:desc="ROM" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ROMLESS" edc:desc="ROMless or on-chip Flash" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FLASH" edc:desc="Embedded Flash Memory" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ROM_FLASH" edc:desc="ROM and Embedded Flash Memory - NVPSIZ is ROM size - NVPSIZ2 is Flash size" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SRAM" edc:desc="SRAM emulating ROM" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXT" edc:nzwidth="0x1" edc:desc="Extension Flag"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
