Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_FFPI" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x400504B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x1" edc:desc="FFPI Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_WAIT_MODE" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x400504BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="CONTROL" edc:nzwidth="0x1" edc:desc="Improved Wait Mode Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROM_CODE" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0x400504C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="PLLA_STATUS" edc:nzwidth="0x2" edc:desc="PLLA Status"/>
            <edc:SFRFieldDef edc:cname="FORCE_BYPASS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FORCE_BYPASS_VALUE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x400504C4"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400504E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x534652"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_WPSR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFF01" edc:_addr="0x400504E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPSRC" edc:nzwidth="0x10" edc:desc="Write Protection Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400504EC"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_SPARE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400504F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="Spare"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400504F4"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_VERSION" edc:nzwidth="0x20" edc:access="-------------rrr----rrrrrrrrrrrr" edc:impl="0x70FFF" edc:_addr="0x400504FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="VERSION" edc:nzwidth="0xC" edc:desc="Version of the Hardware Module"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MFN" edc:nzwidth="0x3" edc:desc="Metal Fix Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x110" edc:_addr="0x40050500"/>
      <edc:SFRDef ltx:memberofperipheral="SFRBU" edc:cname="SFRBU_XTAL_TRIM" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x40050610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFRBU">
            <edc:SFRFieldDef edc:cname="XTAL_TRIM" edc:nzwidth="0x2" edc:desc="32 kHz Crystal Oscillator Trimming Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFRBU" edc:cname="SFRBU_TRIM" edc:nzwidth="0x20" edc:access="----rrrr----rrrr----rrrr--rrrrrr" edc:impl="0xF0F0F3F" edc:_addr="0x40050614">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFRBU">
            <edc:SFRFieldDef edc:cname="RC32" edc:nzwidth="0x6" edc:desc="RC Oscillator Trimming Value"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CONVBG" edc:nzwidth="0x4" edc:desc="Conversion IP Bandgap Trimming Value"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LDO" edc:nzwidth="0x4" edc:desc="Power Management IP LDO Trimming Value"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LCD" edc:nzwidth="0x4" edc:desc="LDO Internal Bandgap Trimming for LCD Driver"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40050618"/>
      <edc:SFRDef ltx:memberofperipheral="SFRBU" edc:cname="SFRBU_BOOT" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40050620">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFRBU">
            <edc:SFRFieldDef edc:cname="SOURCE" edc:nzwidth="0x1" edc:desc="Source for Booting Sequence"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
