Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_WUMR" edc:nzwidth="0x20" edc:access="-nnnnnnnnnnnnnnn-nnn-nnn---nnnnn" edc:impl="0x7FFF771F" edc:_addr="0x400531DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="LPDBCEN0" edc:nzwidth="0x1" edc:desc="Tamper Enable for WKUPx Pin"/>
            <edc:SFRFieldDef edc:cname="LPDBCEN1" edc:nzwidth="0x1" edc:desc="Tamper Enable for WKUPx Pin"/>
            <edc:SFRFieldDef edc:cname="LPDBCEN2" edc:nzwidth="0x1" edc:desc="Tamper Enable for WKUPx Pin"/>
            <edc:SFRFieldDef edc:cname="LPDBCEN3" edc:nzwidth="0x1" edc:desc="Tamper Enable for WKUPx Pin"/>
            <edc:SFRFieldDef edc:cname="LPDBCEN4" edc:nzwidth="0x1" edc:desc="Tamper Enable for WKUPx Pin"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FWUPDBC" edc:nzwidth="0x3" edc:desc="Force Wake-up Inputs Debouncer Period">
              <edc:SFRFieldSemantic edc:cname="IMMEDIATE" edc:desc="Immediate, no debouncing, detected active at least on one Slow Clock edge." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_3_SK" edc:desc="WKUPx shall be in its active state for at least 3 MD_SLCK periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_SK" edc:desc="WKUPx shall be in its active state for at least 32 MD_SLCK periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_512_SK" edc:desc="WKUPx shall be in its active state for at least 512 MD_SLCK periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_4096_SK" edc:desc="WKUPx shall be in its active state for at least 4,096 MD_SLCK periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32768_SK" edc:desc="WKUPx shall be in its active state for at least 32,768 MD_SLCK periods" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPDBC" edc:nzwidth="0x3" edc:desc="Wake-up Inputs Debouncer Period">
              <edc:SFRFieldSemantic edc:cname="IMMEDIATE" edc:desc="Immediate, no debouncing, detected active at least on one Slow Clock edge." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_3_SK" edc:desc="WKUPx shall be in its active state for at least 3 MD_SLCK periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_SK" edc:desc="WKUPx shall be in its active state for at least 32 MD_SLCK periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_512_SK" edc:desc="WKUPx shall be in its active state for at least 512 MD_SLCK periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_4096_SK" edc:desc="WKUPx shall be in its active state for at least 4,096 MD_SLCK periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32768_SK" edc:desc="WKUPx shall be in its active state for at least 32,768 MD_SLCK periods" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPDBC0" edc:nzwidth="0x3" edc:desc="Low-power Debouncer Period of WKUPx">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disables the low-power debouncers." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_RTCOUT" edc:desc="WKUPx in active state for at least 2 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_RTCOUT" edc:desc="WKUPx in active state for at least 3 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_4_RTCOUT" edc:desc="WKUPx in active state for at least 4 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_5_RTCOUT" edc:desc="WKUPx in active state for at least 5 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_6_RTCOUT" edc:desc="WKUPx in active state for at least 6 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_7_RTCOUT" edc:desc="WKUPx in active state for at least 7 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_RTCOUT" edc:desc="WKUPx in active state for at least 8 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBC1" edc:nzwidth="0x3" edc:desc="Low-power Debouncer Period of WKUPx">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disables the low-power debouncers." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_RTCOUT" edc:desc="WKUPx in active state for at least 2 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_RTCOUT" edc:desc="WKUPx in active state for at least 3 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_4_RTCOUT" edc:desc="WKUPx in active state for at least 4 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_5_RTCOUT" edc:desc="WKUPx in active state for at least 5 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_6_RTCOUT" edc:desc="WKUPx in active state for at least 6 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_7_RTCOUT" edc:desc="WKUPx in active state for at least 7 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_RTCOUT" edc:desc="WKUPx in active state for at least 8 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBC2" edc:nzwidth="0x3" edc:desc="Low-power Debouncer Period of WKUPx">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disables the low-power debouncers." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_RTCOUT" edc:desc="WKUPx in active state for at least 2 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_RTCOUT" edc:desc="WKUPx in active state for at least 3 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_4_RTCOUT" edc:desc="WKUPx in active state for at least 4 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_5_RTCOUT" edc:desc="WKUPx in active state for at least 5 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_6_RTCOUT" edc:desc="WKUPx in active state for at least 6 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_7_RTCOUT" edc:desc="WKUPx in active state for at least 7 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_RTCOUT" edc:desc="WKUPx in active state for at least 8 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBC3" edc:nzwidth="0x3" edc:desc="Low-power Debouncer Period of WKUPx">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disables the low-power debouncers." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_RTCOUT" edc:desc="WKUPx in active state for at least 2 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_RTCOUT" edc:desc="WKUPx in active state for at least 3 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_4_RTCOUT" edc:desc="WKUPx in active state for at least 4 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_5_RTCOUT" edc:desc="WKUPx in active state for at least 5 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_6_RTCOUT" edc:desc="WKUPx in active state for at least 6 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_7_RTCOUT" edc:desc="WKUPx in active state for at least 7 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_RTCOUT" edc:desc="WKUPx in active state for at least 8 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBC4" edc:nzwidth="0x3" edc:desc="Low-power Debouncer Period of WKUPx">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disables the low-power debouncers." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_RTCOUT" edc:desc="WKUPx in active state for at least 2 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_RTCOUT" edc:desc="WKUPx in active state for at least 3 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_4_RTCOUT" edc:desc="WKUPx in active state for at least 4 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_5_RTCOUT" edc:desc="WKUPx in active state for at least 5 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_6_RTCOUT" edc:desc="WKUPx in active state for at least 6 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_7_RTCOUT" edc:desc="WKUPx in active state for at least 7 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_RTCOUT" edc:desc="WKUPx in active state for at least 8 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_WUIR" edc:nzwidth="0x20" edc:access="-nnnnnnnnnnnnnnn-nnnnnnnnnnnnnnn" edc:impl="0x7FFF7FFF" edc:_addr="0x400531E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="WKUPEN0" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 0"/>
            <edc:SFRFieldDef edc:cname="WKUPEN1" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 1"/>
            <edc:SFRFieldDef edc:cname="WKUPEN2" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 2"/>
            <edc:SFRFieldDef edc:cname="WKUPEN3" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 3"/>
            <edc:SFRFieldDef edc:cname="WKUPEN4" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 4"/>
            <edc:SFRFieldDef edc:cname="WKUPEN5" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 5"/>
            <edc:SFRFieldDef edc:cname="WKUPEN6" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 6"/>
            <edc:SFRFieldDef edc:cname="WKUPEN7" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 7"/>
            <edc:SFRFieldDef edc:cname="WKUPEN8" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 8"/>
            <edc:SFRFieldDef edc:cname="WKUPEN9" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 9"/>
            <edc:SFRFieldDef edc:cname="WKUPEN10" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 10"/>
            <edc:SFRFieldDef edc:cname="WKUPEN11" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 11"/>
            <edc:SFRFieldDef edc:cname="WKUPEN12" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 12"/>
            <edc:SFRFieldDef edc:cname="WKUPEN13" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 13"/>
            <edc:SFRFieldDef edc:cname="WKUPEN14" edc:nzwidth="0x1" edc:desc="Wake-up Input Enable 14"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPT0" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 0">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT1" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 1">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT2" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 2">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT3" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 3">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT4" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 4">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT5" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 5">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT6" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 6">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT7" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 7">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT8" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 8">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT9" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 9">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT10" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 10">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT11" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 11">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT12" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 12">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT13" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 13">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPT14" edc:nzwidth="0x1" edc:desc="Wake-up Input Type 14">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
