Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PASSR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46004248">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PASSR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4600424C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PASSR4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46004250">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PASSR5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46004254">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PASSR6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46004258">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
