Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PASSR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46004274">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PASSR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46004278">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PASSR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4600427C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PRTSR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46004280">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PRTSR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46004284">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PRTSR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46004288">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PRTSR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4600428C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
