Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_CTRL" edc:nzwidth="0x20" edc:access="-----------------------w-------w" edc:impl="0x101" edc:_addr="0x46008008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Cache Controller Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="Control Lock Until Next System Reset (Write-once)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_SR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4600800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:SFRFieldDef edc:cname="CSTS" edc:nzwidth="0x1" edc:desc="Cache Controller Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x46008010"/>
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_MAINT0" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x46008020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:SFRFieldDef edc:cname="INVALL" edc:nzwidth="0x1" edc:desc="Cache Controller Invalidate All"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_MAINT1" edc:nzwidth="0x20" edc:access="ww-------------------wwwwwww----" edc:impl="0xC00007F0" edc:_addr="0x46008024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="INDEX" edc:nzwidth="0x7" edc:desc="Invalidate Index"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="WAY" edc:nzwidth="0x2" edc:desc="Invalidate Way">
              <edc:SFRFieldSemantic edc:cname="WAY0" edc:desc="Way 0 is selection for index invalidation." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAY1" edc:desc="Way 1 is selection for index invalidation." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WAY2" edc:desc="Way 2 is selection for index invalidation." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="WAY3" edc:desc="Way 3 is selection for index invalidation." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_MCFG" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x46008028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x2" edc:desc="Cache Controller Monitor Counter Mode">
              <edc:SFRFieldSemantic edc:cname="CYCLE_COUNT" edc:desc="Cycle counter" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IHIT_COUNT" edc:desc="Instruction hit counter, only relevant for unified cache and instruction cache architecture" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DHIT_COUNT" edc:desc="Data hit counter, only relevant for unified cache and data cache architecture" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_MEN" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x4600802C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:SFRFieldDef edc:cname="MENABLE" edc:nzwidth="0x1" edc:desc="Cache Controller Monitor Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_MCTRL" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x46008030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Monitor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_MSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x46008034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:SFRFieldDef edc:cname="EVENT_CNT" edc:nzwidth="0x20" edc:desc="Monitor Event Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xAC" edc:_addr="0x46008038"/>
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----n-n" edc:impl="0xFFFFFF05" edc:_addr="0x460080E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:SFRFieldDef edc:cname="WPCFG" edc:nzwidth="0x1" edc:desc="Write Protection Configuration Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WPCR" edc:nzwidth="0x1" edc:desc="Write Protection Control Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPCFG and WPCR bits. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x434D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F18" edc:_addr="0x460080E8"/>
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_TYPE" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrrrrrr" edc:impl="0x3FFF" edc:_addr="0x4600C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:SFRFieldDef edc:cname="AP" edc:nzwidth="0x1" edc:desc="Access Port Access Allowed"/>
            <edc:SFRFieldDef edc:cname="GCLK" edc:nzwidth="0x1" edc:desc="Dynamic Clock Gating Supported"/>
            <edc:SFRFieldDef edc:cname="RANDP" edc:nzwidth="0x1" edc:desc="Random Selection Policy Supported"/>
            <edc:SFRFieldDef edc:cname="LRUP" edc:nzwidth="0x1" edc:desc="Least Recently Used Policy Supported"/>
            <edc:SFRFieldDef edc:cname="RRP" edc:nzwidth="0x1" edc:desc="Random Selection Policy Supported"/>
            <edc:SFRFieldDef edc:cname="WAYNUM" edc:nzwidth="0x2" edc:desc="Number of Ways">
              <edc:SFRFieldSemantic edc:cname="DMAPPED" edc:desc="Direct Mapped Cache" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ARCH2WAY" edc:desc="2-way set associative" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ARCH4WAY" edc:desc="4-way set associative" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ARCH8WAY" edc:desc="8-way set associative" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LCKDOWN" edc:nzwidth="0x1" edc:desc="Lockdown Supported"/>
            <edc:SFRFieldDef edc:cname="CSIZE" edc:nzwidth="0x3" edc:desc="Data Cache Size">
              <edc:SFRFieldSemantic edc:cname="CSIZE_1KB" edc:desc="Cache size is 1 Kbyte" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_2KB" edc:desc="Cache size is 2 Kbytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_4KB" edc:desc="Cache size is 4 Kbytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_8KB" edc:desc="Cache size is 8 Kbytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_16KB" edc:desc="Cache size is 16 Kbytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_32KB" edc:desc="Cache size is 32 Kbytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_64KB" edc:desc="Cache size is 64 Kbytes" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLSIZE" edc:nzwidth="0x3" edc:desc="Cache LIne Size">
              <edc:SFRFieldSemantic edc:cname="CLSIZE_1KB" edc:desc="Cache line size is 4 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_2KB" edc:desc="Cache line size is 8 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_4KB" edc:desc="Cache line size is 16 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_8KB" edc:desc="Cache line size is 32 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
