Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_CFG" edc:nzwidth="0x20" edc:access="-----------------------n-nnn-nnn" edc:impl="0x177" edc:_addr="0x4600C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:SFRFieldDef edc:cname="GCLKDIS" edc:nzwidth="0x1" edc:desc="Disable Clock Gating"/>
            <edc:SFRFieldDef edc:cname="ICDIS" edc:nzwidth="0x1" edc:desc="Instruction Caching Disable"/>
            <edc:SFRFieldDef edc:cname="DCDIS" edc:nzwidth="0x1" edc:desc="Data Caching Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRGCSIZE" edc:nzwidth="0x3" edc:desc="Programmable Cache Size"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="Configuration Lock Until Next System Reset (Write-once)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_CTRL" edc:nzwidth="0x20" edc:access="-----------------------w-------w" edc:impl="0x101" edc:_addr="0x4600C008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Cache Controller Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="Control Lock Until Next System Reset (Write-once)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_SR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4600C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:SFRFieldDef edc:cname="CSTS" edc:nzwidth="0x1" edc:desc="Cache Controller Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x4600C010"/>
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_MAINT0" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x4600C020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:SFRFieldDef edc:cname="INVALL" edc:nzwidth="0x1" edc:desc="Cache Controller Invalidate All"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_MAINT1" edc:nzwidth="0x20" edc:access="ww-------------------wwwwwww----" edc:impl="0xC00007F0" edc:_addr="0x4600C024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="INDEX" edc:nzwidth="0x7" edc:desc="Invalidate Index"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="WAY" edc:nzwidth="0x2" edc:desc="Invalidate Way">
              <edc:SFRFieldSemantic edc:cname="WAY0" edc:desc="Way 0 is selection for index invalidation." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WAY1" edc:desc="Way 1 is selection for index invalidation." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WAY2" edc:desc="Way 2 is selection for index invalidation." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="WAY3" edc:desc="Way 3 is selection for index invalidation." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_MCFG" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x4600C028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x2" edc:desc="Cache Controller Monitor Counter Mode">
              <edc:SFRFieldSemantic edc:cname="CYCLE_COUNT" edc:desc="Cycle counter" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IHIT_COUNT" edc:desc="Instruction hit counter, only relevant for unified cache and instruction cache architecture" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DHIT_COUNT" edc:desc="Data hit counter, only relevant for unified cache and data cache architecture" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_MEN" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x4600C02C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:SFRFieldDef edc:cname="MENABLE" edc:nzwidth="0x1" edc:desc="Cache Controller Monitor Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_MCTRL" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x4600C030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Monitor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_MSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4600C034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:SFRFieldDef edc:cname="EVENT_CNT" edc:nzwidth="0x20" edc:desc="Monitor Event Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xAC" edc:_addr="0x4600C038"/>
      <edc:SFRDef ltx:memberofperipheral="CMCC1" edc:cname="CMCC1_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----n-n" edc:impl="0xFFFFFF05" edc:_addr="0x4600C0E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC1">
            <edc:SFRFieldDef edc:cname="WPCFG" edc:nzwidth="0x1" edc:desc="Write Protection Configuration Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WPCR" edc:nzwidth="0x1" edc:desc="Write Protection Control Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPCFG and WPCR bits. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x434D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xD3F18" edc:_addr="0x4600C0E8"/>
      <edc:SFRDef ltx:memberofperipheral="SEFC0" edc:cname="EEFC_FMR" edc:nzwidth="0x20" edc:access="----nn---------n----nnnn-------n" edc:impl="0xC010F01" edc:_addr="0x460E0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC0">
            <edc:SFRFieldDef edc:cname="FRDY" edc:nzwidth="0x1" edc:desc="Flash Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="FWS" edc:nzwidth="0x4" edc:desc="Flash Wait State"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SCOD" edc:nzwidth="0x1" edc:desc="Sequential Code Optimization Disable"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CLOE" edc:nzwidth="0x1" edc:desc="Code Loop Optimization Enable"/>
            <edc:SFRFieldDef edc:cname="ALWAYS1" edc:nzwidth="0x1" edc:desc="Always Written to One"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SEFC0" edc:cname="EEFC_FCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x460E0004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC0">
            <edc:SFRFieldDef edc:cname="FCMD" edc:nzwidth="0x8" edc:desc="Flash Command">
              <edc:SFRFieldSemantic edc:cname="GETD" edc:desc="Get Flash descriptor" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WP" edc:desc="Write page" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WPL" edc:desc="Write page and lock" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="EPA" edc:desc="Erase pages (8, 16, 32, 64)" edc:when="(field &amp; 0xFF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="SLB" edc:desc="Set lock bit" edc:when="(field &amp; 0xFF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="CLB" edc:desc="Clear lock bit" edc:when="(field &amp; 0xFF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="GLB" edc:desc="Get lock bit" edc:when="(field &amp; 0xFF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="SGPB" edc:desc="Set GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="CGPB" edc:desc="Clear GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="GGPB" edc:desc="Get GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="STUI" edc:desc="Start read unique identifier" edc:when="(field &amp; 0xFF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="SPUI" edc:desc="Stop read unique identifier" edc:when="(field &amp; 0xFF) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="GCALB" edc:desc="Get CALIB bit" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="ES" edc:desc="Erase sector" edc:when="(field &amp; 0xFF) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="WUS" edc:desc="Write user signature" edc:when="(field &amp; 0xFF) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="EUS" edc:desc="Erase user signature" edc:when="(field &amp; 0xFF) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="STUS" edc:desc="Start read user signature" edc:when="(field &amp; 0xFF) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="SPUS" edc:desc="Stop read user signature" edc:when="(field &amp; 0xFF) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="SUSP" edc:desc="Suspend" edc:when="(field &amp; 0xFF) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="RES" edc:desc="Resume" edc:when="(field &amp; 0xFF) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="SCK" edc:desc="Send cryptographic key" edc:when="(field &amp; 0xFF) == 0x19"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FARG" edc:nzwidth="0x10" edc:desc="Flash Command Argument"/>
            <edc:SFRFieldDef edc:cname="FKEY" edc:nzwidth="0x8" edc:desc="Flash Writing Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="The 0x5A value enables the command defined by the bits in the register. If the field is written with a different value, the write is not performed and no action is started." edc:when="(field &amp; 0xFF) == 0x5A"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SEFC0" edc:cname="EEFC_FSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrr----------rrrrrr" edc:impl="0xFF003F" edc:_addr="0x460E0008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC0">
            <edc:SFRFieldDef edc:cname="FRDY" edc:nzwidth="0x1" edc:desc="Flash Ready Status (cleared when Flash is busy)"/>
            <edc:SFRFieldDef edc:cname="FCMDE" edc:nzwidth="0x1" edc:desc="Flash Command Error Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="FLOCKE" edc:nzwidth="0x1" edc:desc="Flash Lock Error Status (cleared on read or by writing EEFC_FCR)"/>
            <edc:SFRFieldDef edc:cname="FLERR" edc:nzwidth="0x1" edc:desc="Flash Error Status (cleared when a programming operation starts)"/>
            <edc:SFRFieldDef edc:cname="WPERR" edc:nzwidth="0x1" edc:desc="Write Protection Error Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="FLSUSP" edc:nzwidth="0x1" edc:desc="Flash Suspended Status (cleared when resuming the programming operation)"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="SECCELSBD" edc:nzwidth="0x1" edc:desc="Single ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="MECCELSBD" edc:nzwidth="0x1" edc:desc="Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SECCEMSBD" edc:nzwidth="0x1" edc:desc="Single ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="MECCEMSBD" edc:nzwidth="0x1" edc:desc="Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SECCELSBL" edc:nzwidth="0x1" edc:desc="Single ECC Error on LSB Part of the Memory Lock Bits"/>
            <edc:SFRFieldDef edc:cname="MECCELSBL" edc:nzwidth="0x1" edc:desc="Multiple ECC Error on LSB Part of the Memory Lock Bits"/>
            <edc:SFRFieldDef edc:cname="SECCEMSBL" edc:nzwidth="0x1" edc:desc="Single ECC Error on MSB Part of the Memory Lock Bits"/>
            <edc:SFRFieldDef edc:cname="MECCEMSBL" edc:nzwidth="0x1" edc:desc="Multiple ECC Error on MSB Part of the Memory Lock Bits"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SEFC0" edc:cname="EEFC_FRR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x460E000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC0">
            <edc:SFRFieldDef edc:cname="FVALUE" edc:nzwidth="0x20" edc:desc="Flash Result Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SEFC0" edc:cname="EEFC_USR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x460E0010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC0">
            <edc:SFRFieldDef edc:cname="RDENUSB0" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 0"/>
            <edc:SFRFieldDef edc:cname="RDENUSB1" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 1"/>
            <edc:SFRFieldDef edc:cname="RDENUSB2" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 2"/>
            <edc:SFRFieldDef edc:cname="RDENUSB3" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 3"/>
            <edc:SFRFieldDef edc:cname="RDENUSB4" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 4"/>
            <edc:SFRFieldDef edc:cname="RDENUSB5" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 5"/>
            <edc:SFRFieldDef edc:cname="RDENUSB6" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 6"/>
            <edc:SFRFieldDef edc:cname="RDENUSB7" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 7"/>
            <edc:SFRFieldDef edc:cname="WRENUSB0" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 0"/>
            <edc:SFRFieldDef edc:cname="WRENUSB1" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 1"/>
            <edc:SFRFieldDef edc:cname="WRENUSB2" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 2"/>
            <edc:SFRFieldDef edc:cname="WRENUSB3" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 3"/>
            <edc:SFRFieldDef edc:cname="WRENUSB4" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 4"/>
            <edc:SFRFieldDef edc:cname="WRENUSB5" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 5"/>
            <edc:SFRFieldDef edc:cname="WRENUSB6" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 6"/>
            <edc:SFRFieldDef edc:cname="WRENUSB7" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 7"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB0" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 0"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB1" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 1"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB2" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 2"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB3" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 3"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB4" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 4"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB5" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 5"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB6" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 6"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB7" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 7"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB0" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 0"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB1" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 1"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB2" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 2"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB3" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 3"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB4" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 4"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB5" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 5"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB6" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 6"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB7" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
