Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/edc/PIC32CX2051MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="PIO1" edc:cname="PIO_P0PIO1_P_IOSSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4800D038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO1">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIO1" edc:cname="PIO_P0PIO1_P_IOFR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwww------ww" edc:impl="0xFFFFFF03" edc:_addr="0x4800D03C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO1">
            <edc:SFRFieldDef edc:cname="FPHY" edc:nzwidth="0x1" edc:desc="Freeze Physical Configuration"/>
            <edc:SFRFieldDef edc:cname="FINT" edc:nzwidth="0x1" edc:desc="Freeze Interrupt Configuration"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="FRZKEY" edc:nzwidth="0x18" edc:desc="Freeze Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit." edc:when="(field &amp; 0xFFFFFF) == 0x494F46"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
